---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient2Wall
source: html/a7c16711-d227-64b8-b0a9-f6f39ce7c579.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient2Wall Property

"Alternating Bar - Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinHookOrient2Wall { get; }
```